const mongoose = require('mongoose');
const Product = require('./models/Product');

mongoose.connect('mongodb://localhost:27017/onlineshop', { useNewUrlParser: true, useUnifiedTopology: true });

const products = [
    {
        "name": "پیراهن آستین بلند راه راه آبی",
        "image": "cloth1.jpg",
        "price": 7150000,
        "fit": "معمولی",
        "description": "پیراهن‌های کلاسیک هاکوپیان در طیف متنوعی از رنگ‌ و طرح‌ ارائه می‌شوند. در این پیراهن‌ها هیچ‌گونه الیاف مصنوعی استفاده نشده است و کلیه پارچه‌ها از الیاف پنبه تولید شده‌اند. پارچه این پیراهن‌ها به دلیل آن که مانع از گردش هوا نمی‌شود خنک‌تر از سایر پارچه‌ها است، همچنین به‌ راحتی شسته و تمیز می‌شوند. پارچه‌های استفاده‌شده در این پیراهن‌ها به دلیل طبیعی بودن الیاف چروک پذیرند بنابراین دانستن نحوه صحیح استفاده و مراقبت از آن‌ها لازم و ضروری است.",
        "details": "کدکالا: 204-0476139\nترکیبات پارچه: 100% پنبه\nقد: متوسط\nکشور تولید کننده پارچه: ترکیه\nفصل: بهار-تابستان\nزمان تولید: کلکسیون 2024",
        "usage": "اداری، رسمی"
    }
    ,
    {
        "name": "پیراهن آستین بلند سفید",
        "image": "cloth2.jpg",
        "price": 7150000,
        "fit": "معمولی",
        "description": "پیراهن‌های کلاسیک هاکوپیان در طیف متنوعی از رنگ‌ و طرح‌ ارائه می‌شوند. در این پیراهن‌ها هیچ‌گونه الیاف مصنوعی استفاده نشده است و کلیه پارچه‌ها از الیاف پنبه تولید شده‌اند. پارچه این پیراهن‌ها به دلیل آن که مانع از گردش هوا نمی‌شود خنک‌تر از سایر پارچه‌ها است، همچنین به‌ راحتی شسته و تمیز می‌شوند. پارچه‌های استفاده‌شده در این پیراهن‌ها به دلیل طبیعی بودن الیاف چروک پذیرند بنابراین دانستن نحوه صحیح استفاده و مراقبت از آن‌ها لازم و ضروری است.",
        "details": "کدکالا: 201-0436141\nترکیبات پارچه: 100% پنبه\nقد: متوسط\nکشور تولید کننده پارچه: ترکیه\nفصل: همه فصول\nزمان تولید: کلکسیون 2025",
        "usage": "اداری، رسمی"
    }
    ,
    {
        "name": "پیراهن آستین بلند صورتی",
        "image": "cloth3.jpg",
        "price": 7150000,
        "fit": "معمولی",
        "description": "پیراهن‌های کلاسیک هاکوپیان در طیف متنوعی از رنگ‌ و طرح‌ ارائه می‌شوند. در این پیراهن‌ها هیچ‌گونه الیاف مصنوعی استفاده نشده است و کلیه پارچه‌ها از الیاف پنبه تولید شده‌اند. پارچه این پیراهن‌ها به دلیل آن که مانع از گردش هوا نمی‌شود خنک‌تر از سایر پارچه‌ها است، همچنین به‌ راحتی شسته و تمیز می‌شوند. پارچه‌های استفاده‌شده در این پیراهن‌ها به دلیل طبیعی بودن الیاف چروک پذیرند بنابراین دانستن نحوه صحیح استفاده و مراقبت از آن‌ها لازم و ضروری است.",
        "details": "کدکالا: 146-0436145\nترکیبات پارچه: 100% پنبه\nقد: متوسط\nکشور تولید کننده پارچه: ترکیه\nفصل: همه فصول\nزمان تولید: کلکسیون 2024",
        "usage": "اداری، رسمی"
    }
    ,
    {
        "name": "تیشرت پنبه ای طوسی",
        "image": "cloth4.jpg",
        "price": 4950000,
        "fit": "معمولی",
        "description": "تیشرت‌های هاکوپیان با الياف طبيعي خود سبکی، نرمی و راحتی را به همراه دارند. این تیشرت‌ها امکان ست شدن با انواع کت تک کژوال، شلوار جین، شلوار پنبه‌ای و شلوارک را دارند.",
        "details": "کدکالا: 212-7536406\nطرح: ساده\nجنس پارچه: 100%پنبه\nکشور تولید کننده پارچه: پرتغال\nفصل:  بهار و تابستان\nزمان تولید: کلکسیون 2024",
        "usage": "روزمره"
    }
    ,
    {
        "name": "پیراهن آستین بلند سفید",
        "image": "cloth5.jpg",
        "price": 6600000,
        "fit": "معمولی",
        "description": "پیراهن‌های کلاسیک هاکوپیان در طیف متنوعی از رنگ‌ و طرح‌ ارائه می‌شوند. در این پیراهن‌ها هیچ‌گونه الیاف مصنوعی استفاده نشده است و کلیه پارچه‌ها از الیاف پنبه تولید شده‌اند. پارچه این پیراهن‌ها به دلیل آن که مانع از گردش هوا نمی‌شود خنک‌تر از سایر پارچه‌ها است، همچنین به‌ راحتی شسته و تمیز می‌شوند. پارچه‌های استفاده‌شده در این پیراهن‌ها به دلیل طبیعی بودن الیاف چروک پذیرند بنابراین دانستن نحوه صحیح استفاده و مراقبت از آن‌ها لازم و ضروری است.",
        "details": "کدکالا: 089-0436141\nترکیبات پارچه: 100% پنبه\nقد: متوسط\nکشور تولید کننده پارچه: اتحادیه اروپا\nفصل: همه فصول\nزمان تولید: کلکسیون 2023",
        "usage": "اداری، رسمی"
    }
    ,
    {
        "name": "پیراهن آستین بلند مشکی",
        "image": "cloth6.jpg",
        "price": 5500000,
        "fit": "معمولی",
        "description": "پیراهن‌های کلاسیک هاکوپیان در طیف متنوعی از رنگ‌ و طرح‌ ارائه می‌شوند. در این پیراهن‌ها هیچ‌گونه الیاف مصنوعی استفاده نشده است و کلیه پارچه‌ها از الیاف پنبه تولید شده‌اند. پارچه این پیراهن‌ها به دلیل آن که مانع از گردش هوا نمی‌شود خنک‌تر از سایر پارچه‌ها است، همچنین به‌ راحتی شسته و تمیز می‌شوند. پارچه‌های استفاده‌شده در این پیراهن‌ها به دلیل طبیعی بودن الیاف چروک پذیرند بنابراین دانستن نحوه صحیح استفاده و مراقبت از آن‌ها لازم و ضروری است.",
        "details": "کدکالا: 112-6636501\nترکیبات پارچه: 100% پنبه\nقد: متوسط\nکشور تولید کننده پارچه: ترکیه\nفصل: همه فصول\nزمان تولید: کلکسیون 24-2023",
        "usage": "اداری، رسمی"
    }

];

async function seed() {
    await Product.deleteMany({});
    await Product.insertMany(products);
    console.log('Products seeded!');
    mongoose.disconnect();
}

seed();
